{
  "id": 8141,
  "title": "EIP-8141: Frame Transaction",
  "status": "Draft",
  "description": "Add a new transaction type whose validity and gas payment can be defined abstractly. Instead of relying solely on ECDSA signatures, accounts may freely define and interpret their signature scheme using any cryptographic system.",
  "author": "Vitalik Buterin (@vbuterin), lightclient (@lightclient), Felix Lange (@fjl), Yoav Weiss (@yoavw), Alex Forshtat (@forshtat), Dror Tirosh (@drortirosh), Shahaf Nacson (@shahafn)",
  "type": "Standards Track",
  "category": "Core",
  "createdDate": "2026-01-29",
  "discussionLink": "https://ethereum-magicians.org/t/frame-transaction/27617",
  "layer": "EL",
  "forkRelationships": [
    {
      "forkName": "Hegota",
      "statusHistory": [],
      "isHeadliner": true,
      "wasHeadlinerCandidate": false,
      "champion": {
        "name": "Felix Lange",
        "discord": "fjl"
      },
      "presentationHistory": [
        {
          "type": "headliner_proposal",
          "link": "https://ethereum-magicians.org/t/hegota-headliner-proposal-frame-transaction/27618",
          "date": "2026-01-29"
        },
        {
          "type": "headliner_presentation",
          "call": "acde/229",
          "date": "2026-01-29"
        }
      ]
    }
  ],
  "laymanDescription": "A new way for Ethereum accounts to verify transactions using any security method, not just the current cryptographic system. This enables quantum-resistant security, flexible wallets with social recovery and multi-sig, and lets someone else pay your transaction fees.",
  "northStarAlignment": {
    "improveUX": {
      "description": "Enables flexible wallet security (social recovery, multi-sig, spending limits), native gas sponsorship, and better onboarding UX without trusted intermediaries."
    }
  },
  "stakeholderImpacts": {
    "endUsers": {
      "description": "Better wallet UX with flexible security options and ability to use quantum-resistant signatures."
    },
    "appDevs": {
      "description": "Native AA infrastructure enables easier user onboarding with gas sponsorship."
    },
    "walletDevs": {
      "description": "Can implement advanced wallet features natively without ERC-4337 bundler overhead."
    },
    "toolingInfra": {
      "description": "Need to support new transaction type, opcodes, and per-frame receipt format."
    },
    "layer2s": {
      "description": "Can adopt same AA patterns for consistent L1/L2 user experience."
    },
    "stakersNodes": {
      "description": "New transaction type processing with frame execution model."
    },
    "clClients": {
      "description": "Minimal direct impact as the transaction type is EL-focused."
    },
    "elClients": {
      "description": "Significant implementation: new transaction type, APPROVE and TXPARAM* opcodes, frame execution model."
    }
  },
  "benefits": [
    "Provides native off-ramp from ECDSA to post-quantum secure signature systems",
    "Realizes account abstraction vision with user-defined validation and gas payment",
    "Enables gas sponsorship without trusted intermediaries",
    "More efficient than ERC-4337, eliminates bundler infrastructure"
  ],
  "tradeoffs": [
    "New DoS vectors for transaction pools requiring mempool rule restrictions",
    "ORIGIN opcode behavior changes for frame transactions"
  ]
}
